; domain
(define (domain rusty_bolt_problem)
    (:requirements :strips :typing)
    (:types entity drink towel bolt)
    
    (:predicates 
        (obtained ?x - drink)
        (on_bolt ?x - drink)
        (on_towel ?x - drink)
        (clean ?x - towel)
        (dirty ?x - towel)
        (stuck ?x - bolt)
        (unstuck ?x - bolt)
        (in_package ?x - bolt)
        (in_machine ?x - bolt)
    )

    (:action obtain_fizzy_drink
        :parameters (?d - drink)
        :precondition (not (obtained ?d))
        :effect (obtained ?d)
    )

    (:action pour_fizzy_drink
        :parameters (?d - drink ?b - bolt)
        :precondition (and (obtained ?d) (stuck ?b))
        :effect (and (on_bolt ?d) (not (obtained ?d)))
    )

    (:action wipe_clean
        :parameters (?t - towel ?d - drink)
        :precondition (and (on_bolt ?d) (clean ?t))
        :effect (and (on_towel ?d) (dirty ?t))
    )

    (:action dissolve_rust
        :parameters (?b - bolt ?d - drink)
        :precondition (and (on_towel ?d) (stuck ?b))
        :effect (and (unstuck ?b) (not (stuck ?b)))
    )
    
    (:action replace_bolt
        :parameters (?b_old - bolt ?b_new - bolt)
        :precondition (and (unstuck ?b_old) (in_package ?b_new))
        :effect (and (in_machine ?b_new) (not (in_package ?b_new)))
    )
)

; problem
(define (problem open_rusty_bolt_problem)
    (:domain rusty_bolt_problem)
    
    (:objects
        fizzy_drink1 - drink
        towel1 - towel
        old_bolt1 - bolt
        new_bolt1 - bolt
    )
    
    (:init
        (not (obtained fizzy_drink1))
        (clean towel1)
        (stuck old_bolt1)
        (in_package new_bolt1)
    )

    (:goal 
        (and
            (unstuck old_bolt1)
            (in_machine new_bolt1)
        )
    )
)

; plan
1. (obtain_fizzy_drink fizzy_drink1)
   added: (obtained fizzy_drink1)
   goals met: 0 of 2
2. (pour_fizzy_drink fizzy_drink1 old_bolt1)
   deleted: (obtained fizzy_drink1)
   added: (on_bolt fizzy_drink1)
   goals met: 0 of 2
3. (wipe_clean towel1 fizzy_drink1)
   added: (on_towel fizzy_drink1) (dirty towel1)
   goals met: 0 of 2
4. (dissolve_rust old_bolt1 fizzy_drink1)
   deleted: (stuck old_bolt1)
   added: (unstuck old_bolt1)
   goals met: 1 of 2
5. (replace_bolt old_bolt1 new_bolt1)
   deleted: (in_package new_bolt1)
   added: (in_machine new_bolt1)
   goals met: 2 of 2
